Revit 2027 API
ElementStructuralTypeFilter.StructuralType Property
 The structural type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public StructuralType StructuralType { get; }
Public ReadOnly Property StructuralType As StructuralType
	Get
public:
property StructuralType StructuralType {
	StructuralType get ();
}
member StructuralType : StructuralType with get
Property Value
StructuralType
See Also
Reference
ElementStructuralTypeFilter Class
Autodesk.Revit.DB Namespace